#include "global.h"
#include "main.h"
#include "battle.h"
#include "battle_anim.h"
#include "frontier_util.h"
#include "battle_message.h"
#include "battle_tent.h"
#include "battle_factory.h"
#include "bg.h"
#include "swsh_summary_screen.h"
#include "contest.h"
#include "contest_effect.h"
#include "data.h"
#include "daycare.h"
#include "decompress.h"
#include "dynamic_placeholder_text_util.h"
#include "egg_hatch.h"
#include "event_data.h"
#include "gpu_regs.h"
#include "graphics.h"
#include "international_string_util.h"
#include "item.h"
#include "item_icon.h"
#include "link.h"
#include "m4a.h"
#include "malloc.h"
#include "menu.h"
#include "menu_helpers.h"
#include "menu_specialized.h"
#include "trig.h"
#include "mon_markings.h"
#include "move_relearner.h"
#include "naming_screen.h"
#include "party_menu.h"
#include "palette.h"
#include "pokeball.h"
#include "pokemon.h"
#include "pokemon_sprite_visualizer.h"
#include "pokemon_storage_system.h"
#include "pokemon_summary_screen.h"
#include "pokerus.h"
#include "region_map.h"
#include "scanline_effect.h"
#include "sound.h"
#include "sprite.h"
#include "string_util.h"
#include "strings.h"
#include "task.h"
#include "text.h"
#include "tv.h"
#include "window.h"
#include "constants/abilities.h"
#include "constants/battle_move_effects.h"
#include "constants/characters.h"
#include "constants/hold_effects.h"
#include "constants/items.h"
#include "constants/moves.h"
#include "constants/party_menu.h"

#define PSS_LABEL_WINDOW_PROMPT_IV_EV_STATS 4
#define PSS_LABEL_WINDOW_PROMPT_MOVES 5

#define PSS_LABEL_WINDOW_END 6

// Dynamic fields for the Pokémon Info page
#define PSS_DATA_WINDOW_INFO_ITEM 0
#define PSS_DATA_WINDOW_INFO_SPECIES 1
// #define PSS_DATA_WINDOW_INFO_OT_OTID 3

// Dynamic fields for the Pokémon Skills page
#define PSS_DATA_WINDOW_SKILLS_STATS 0
#define PSS_DATA_WINDOW_SKILLS_ABILITY 1

// Dynamic fields for the Battle Moves page
#define PSS_DATA_WINDOW_MOVE_NAMES_PP 0
#define PSS_DATA_WINDOW_MOVE_DESCRIPTION 1

// Dynamic fields for the Pokémon Memo page
#define PSS_DATA_WINDOW_MEMO_NOTE 0
#define PSS_DATA_WINDOW_MEMO_EXP 1

#define MOVE_SLOT_COUNT 5
#define MOVE_SLOT_SPRITES_COUNT 5
#define MOVE_FRAME_SPRITES_COUNT 10
#define HELD_ITEM_BOX_SPRITES_COUNT 20
#define ABILITY_BOX_SPRITES_COUNT 15
#define DYNAMAX_LEVEL_SPRITES_COUNT 10
#define DYNAMAX_BOX_SPRITES_COUNT 5
#define TYPE_ICON_SPRITE_COUNT (MAX_MON_MOVES + 1)
#define MON_CHARACTERISTIC_COUNT (6 * 5)

// Default font, see PrintTextOnWindow
#define PSS_DEFAULT_FONT FONT_SHORT_NARROW
// for the spriteIds field in PokemonSummaryScreenData
enum SwShSummarySprites
{
    SPRITE_ARR_ID_MON,
    SPRITE_ARR_ID_SHADOW,
    SPRITE_ARR_ID_BALL,
    SPRITE_ARR_ID_STATUS,
    SPRITE_ARR_ID_GENDER,
    SPRITE_ARR_ID_GIGANTAMAX,
    // all sprites below are considered "page-specific" and will be hidden when switching pages
    SPRITE_ARR_ID_POKERUS_CURED,
    SPRITE_ARR_ID_ITEM,
    SPRITE_ARR_ID_SHINY,
    SPRITE_ARR_ID_FRIENDSHIP,
    SPRITE_ARR_ID_CATEGORY,
    SPRITE_ARR_ID_HP_GRADE,
    SPRITE_ARR_ID_ATK_GRADE,
    SPRITE_ARR_ID_DEF_GRADE,
    SPRITE_ARR_ID_SPA_GRADE,
    SPRITE_ARR_ID_SPD_GRADE,
    SPRITE_ARR_ID_SPE_GRADE,
    SPRITE_ARR_ID_LR_BUTTON,
    SPRITE_ARR_ID_INFO_PROMPT,
    SPRITE_ARR_ID_TERA_TYPE,
    SPRITE_ARR_ID_TYPE, // 2 for mon types, 5 for move types(4 moves and 1 to learn), used interchangeably, because mon types and move types aren't shown on the same screen
    SPRITE_ARR_ID_MOVE_SLOT = SPRITE_ARR_ID_TYPE + TYPE_ICON_SPRITE_COUNT,
    SPRITE_ARR_ID_MOVE_CURSOR = SPRITE_ARR_ID_MOVE_SLOT + (MOVE_SLOT_SPRITES_COUNT * MOVE_SLOT_COUNT),
    SPRITE_ARR_ID_MOVE_FRAME = SPRITE_ARR_ID_MOVE_CURSOR + 1,
    SPRITE_ARR_ID_HELD_ITEM_BOX = SPRITE_ARR_ID_MOVE_FRAME + MOVE_FRAME_SPRITES_COUNT,
    SPRITE_ARR_ID_ABILITY_BOX = SPRITE_ARR_ID_HELD_ITEM_BOX + HELD_ITEM_BOX_SPRITES_COUNT,
    SPRITE_ARR_ID_DYNAMAX_BOX = SPRITE_ARR_ID_ABILITY_BOX + ABILITY_BOX_SPRITES_COUNT,
    SPRITE_ARR_ID_DYNAMAX_LEVEL = SPRITE_ARR_ID_DYNAMAX_BOX + DYNAMAX_BOX_SPRITES_COUNT,
#if SWSH_SUMMARY_SHOW_CONTEST_PAGES
    SPRITE_ARR_ID_CONTEST_CATEGORY = SPRITE_ARR_ID_DYNAMAX_LEVEL + DYNAMAX_LEVEL_SPRITES_COUNT,
    SPRITE_ARR_ID_MAX_COND_SPARKLE = SPRITE_ARR_ID_CONTEST_CATEGORY + CONTEST_CATEGORIES_COUNT,
    SPRITE_ARR_ID_COUNT = SPRITE_ARR_ID_MAX_COND_SPARKLE + CONTEST_CATEGORIES_COUNT,
#else
    SPRITE_ARR_ID_COUNT = SPRITE_ARR_ID_DYNAMAX_LEVEL + DYNAMAX_LEVEL_SPRITES_COUNT,
#endif
};

static EWRAM_DATA struct PokemonSummaryScreenData
{
    /*0x00*/ union {
        struct Pokemon *mons;
        struct BoxPokemon *boxMons;
    } monList;
    /*0x04*/ MainCallback callback;
    /*0x08*/ struct Sprite *markingsSprite;
    /*0x0C*/ void *markingComboTilesPtr;
    /*0x10*/ struct Pokemon currentMon;
    /*0x70*/ struct PokeSummary
    {
        enum Species species; // 0x0
        enum Species species2; // 0x2
        u8 isEgg:1; // 0x4
        u8 isShiny:1;
        u8 padding:6;
        u8 level; // 0x5
        u8 ribbonCount; // 0x6
        u8 ailment; // 0x7
        u8 abilityNum; // 0x8
        u8 metLocation; // 0x9
        u8 metLevel; // 0xA
        u8 metGame; // 0xB
        u32 pid; // 0xC
        u32 exp; // 0x10
        enum Move moves[MAX_MON_MOVES]; // 0x14
        u8 pp[MAX_MON_MOVES]; // 0x1C
        u16 currentHP; // 0x20
        u16 maxHP; // 0x22
        u16 atk; // 0x24
        u16 def; // 0x26
        u16 spatk; // 0x28
        u16 spdef; // 0x2A
        u16 speed; // 0x2C
        enum Item item; // 0x2E
        u16 friendship; // 0x30
        u8 OTGender; // 0x32
        u8 nature; // 0x33
        u8 ppBonuses; // 0x34
        u8 sanity; // 0x35
        u8 OTName[17]; // 0x36
        u32 OTID; // 0x48
        enum Type teraType;
        u8 mintNature;
        u8 ivHp;
        u8 ivAtk;
        u8 ivDef;
        u8 ivSpatk;
        u8 ivSpdef;
        u8 ivSpeed;
        u8 evHp;
        u8 evAtk;
        u8 evDef;
        u8 evSpatk;
        u8 evSpdef;
        u8 evSpeed; // 0x56
    } summary;
    u16 bg3TilemapBuffers[PSS_BUFFER_SIZE];
    u16 bg2TilemapBuffers[PSS_PAGE_COUNT][PSS_BUFFER_SIZE];
    u16 bg1TilemapBuffers[PSS_EFFECT_COUNT][PSS_BUFFER_SIZE];
    u8 mode;
    bool8 isBoxMon;
    u8 curMonIndex;
    u8 maxMonIndex;
    u8 currPageIndex;
    u8 minPageIndex;
    u8 maxPageIndex;
    bool8 lockMonFlag; // This is used to prevent the player from changing Pokémon in the move deleter select, etc, but it is not needed because the input is handled differently there
    u16 newMove;
    u8 firstMoveIndex;
    u8 secondMoveIndex;
    bool8 lockMovesFlag; // This is used to prevent the player from changing position of moves in a battle or when trading.
    u8 hasRelearnableMoves;
    u8 windowIds[2];
    u8 spriteIds[SPRITE_ARR_ID_COUNT];
    s16 switchCounter; // Used for various switch statement cases that decompress/load graphics or Pokémon data
    u16 monAnimTimer; // tracks time between re-playing mon anims
